var data = [];

var dataStr = '1、朱超<br>\
<br>\
导演：彼得·杰克逊<br>\
类型：动作 / 奇幻 / 冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
2、朱超<br>\
<br>\
导演：彼得·杰克逊<br>\
类型：动作 / 奇幻 / 冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
3、朱超<br>\
<br>\
导演：彼得·杰克逊<br>\
类型：动作 / 奇幻 / 冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
4、朱超<br>\
<br>\
导演：彼得·杰克逊<br>\
类型：动作 / 奇幻 / 冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
5、曹琳<br>\
<br>\
导演：彼得·杰克逊<br>\
类型：动作 / 奇幻 / 冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
6、曹琳<br>\
<br>\
导演：彼得·杰克逊<br>\
类型：动作 / 奇幻 / 冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
7、曹琳<br>\
<br>\
导演：彼得·杰克逊<br>\
类型：动作 / 奇幻 / 冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
8、高叶润<br>\
<br>\
导演：彼得·杰克逊<br>\
类型：动作 / 奇幻 / 冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
9、高叶润<br>\
<br>\
导演：彼得·杰克逊<br>\
类型：动作 / 奇幻 / 冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
10、黄昕琦<br>\
<br>\
导演：彼得·杰克逊<br>\
类型：动作 / 奇幻 / 冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
11、黄昕琦<br>\
<br>\
导演：彼得·杰克逊<br>\
类型：动作 / 奇幻 / 冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
12、金钰<br>\
<br>\
导演：彼得·杰克逊<br>\
类型：动作 / 奇幻 / 冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
13、金钰<br>\
<br>\
导演：彼得·杰克逊<br>\
类型：动作 / 奇幻 / 冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
14、娄方旭<br>\
<br>\
导演：彼得·杰克逊<br>\
类型：动作 / 奇幻 / 冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
15、基友一对三缺一<br>\
<br>\
导演：彼得·杰克逊<br>\
类型：动作 / 奇幻 / 冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
16、娄方旭<br>\
<br>\
导演：彼得·杰克逊<br>\
类型：动作 / 奇幻 / 冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
17、石晴蔚<br>\
<br>\
导演：彼得·杰克逊<br>\
类型：动作 / 奇幻 / 冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
18、石晴蔚<br>\
<br>\
导演：彼得·杰克逊<br>\
类型：动作 / 奇幻 / 冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
19、舒超<br>\
<br>\
导演：彼得·杰克逊<br>\
类型：动作 / 奇幻 / 冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
20、舒超<br>\
<br>\
导演：彼得·杰克逊<br>\
类型：动作 / 奇幻 / 冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
21、舒超<br>\
<br>\
导演：彼得·杰克逊<br>\
类型：动作 / 奇幻 / 冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
22、谢宇珊<br>\
<br>\
导演：彼得·杰克逊<br>\
类型：动作 / 奇幻 / 冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
23、张迪源<br>\
<br>\
导演：彼得·杰克逊<br>\
类型：动作 / 奇幻 / 冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
24、张迪源<br>\
<br>\
导演：彼得·杰克逊<br>\
类型：动作 / 奇幻 / 冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
25、张迪源<br>\
<br>\
导演：彼得·杰克逊<br>\
类型：动作 / 奇幻 / 冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
26、刘莹莹<br>\
<br>\
导演：彼得·杰克逊<br>\
类型：动作 / 奇幻 / 冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
27、樱花<br>\
<br>\
导演：彼得·杰克逊<br>\
类型：动作 / 奇幻 / 冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
28、支梦颖<br>\
<br>\
导演：彼得·杰克逊<br>\
类型：动作 / 奇幻 / 冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
29、支梦颖<br>\
<br>\
导演：彼得·杰克逊<br>\
类型：动作 / 奇幻 / 冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
30、钟浩宇<br>\
<br>\
导演：彼得·杰克逊<br>\
类型：动作 / 奇幻 / 冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
31、钟浩宇<br>\
<br>\
导演：彼得·杰克逊<br>\
类型：动作 / 奇幻 / 冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长：144分钟<br>\
';
var d = dataStr.split('<br><br><br>')
for (var i = 0; i < d.length; i++) {
    var c = d[i].split('<br><br>');
    data.push({
        img: c[0].replace('、', ' ') + '.jpg',
        caption: c[0].split('、')[1],
        desc: c[1]
    });
    console.log(c[0].replace('、', '') + '.jpg');
};
//照片翻转
// JavaScript Document